Show / Hide Table of Contents
Enum IntDiagCheckMethod
Flags controlling the method of the check by a interaction diagram
Namespace: IdeaRS.OpenModel.Concrete.CheckResult
Assembly: IdeaRS.OpenModel.dll
Syntax
public enum IntDiagCheckMethod
Fields
 Name |  Description
 IDCheckTypeNMuMu
know Ned; calculate +-Mrd
 IDCheckTypeNuMM
know Med; calculate +-Nrd
 IDCheckTypeNuMuMu
known Ned,Med; calculate Nrd,Mrd as intersection of ID and line=[0,0];[Ned,Med]
 IDOnlyPlanarCheck
Only planar check is required
 IDOnlyUlsForce1
Find intersection only in the direction of the Fd
 IDPlanar_0deg
used by CheckForceQuick
 IDPlanar_90deg
used by CheckForceQuick
 IDPlaneInfoRequest
Information about plane of deformation is required
 Improve this Doc
 View Source